app/views/devise/registrations/new.html.erb

SELECT `clientes`.* FROM `clientes`
SELECT `roles`.* FROM `roles`
---
    <%= f.input :email, required: true, autofocus: true %>
    <%= f.input :cliente_id, required: true, :collection => Cliente.all, :label_method => :nombre, :value_method => :id%>
<%# agregando collection para ROL %>
    <%= f.input :roles, required: true, :collection => Role.all, :label_method => :name, :value_method => :id%>