app/views/users/_form.html.erb

SELECT `roles`.id FROM `roles` INNER JOIN `users_roles` ON `roles`.`id` = `users_roles`.`role_id` WHERE `users_roles`.`user_id` = 10
---
        <% Role.where("name <> 'dios'").each do |role| %>
          <%= check_box_tag "user[role_ids][]", role.id, @user.role_ids.include?(role.id) %>