app/views/users/index.html.erb

    <% current = current_user.cliente_id %>
    <% users = User.where(cliente_id: current) %>
---
SELECT `users`.* FROM `users` WHERE `users`.`cliente_id` = 1