app/controllers/clientes_controller.rb

INSERT INTO `clientes` (`created_at`, `direccion`, `email`, `nombre`, `nombre_contacto`, `razon_social`, `region_id`, `rut`, `telefono`, `updated_at`) VALUES ('2014-03-26 18:29:57', 'kajshdkjashjd 636', 'cccc@ssss.cl', 'cliente', 'piko', 'cliente_razon_social', 1, '19828123-9', '019283', '2014-03-26 18:29:57')
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

UPDATE `clientes` SET `nombre_contacto` = 'piko', `updated_at` = '2014-03-26 19:00:47' WHERE `clientes`.`id` = 2
---
  def update
    respond_to do |format|
      if @cliente.update(cliente_params)

DELETE FROM `clientes` WHERE `clientes`.`id` = 1
---
  def destroy
    @cliente.destroy