app/controllers/users_controller.rb

  def index
    cliente = current_user.cliente
    users = User.where(cliente_id: cliente)
---
SELECT `users`.* FROM `users` WHERE `users`.`cliente_id` = 1

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`apellido1`, `apellido2`, `cliente_id`, `created_at`, `email`, `encrypted_password`, `fono`, `nombre`, `rut`, `updated_at`) VALUES ('Bravo', 'Pavez', 1, '2014-04-08 17:25:37', 'monica@beevir.com', '$2a$10$ZxuBx/Yct6rqChNra0fZuuVZ.Esd7oJp1eQYxup5oV7veU/xR9Tau', '86849388', 'Monica', '15698941-k', '2014-04-08 17:25:37')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `nombre` = '', `apellido1` = '', `apellido2` = '', `rut` = '', `fono` = '', `encrypted_password` = '$2a$10$ABapwFznqFNm4OF5hiEt8uLVXWmkreuXPJX.LnzS5t.f2552YsXL.', `cliente_id` = 1, `updated_at` = '2014-04-10 14:31:58' WHERE `users`.`id` = 1